test/artillery/design/testPostDesign.yml
config:
  target: https://patena-api.herokuapp.com
  payload:
    # path relativo a la localización del script de test
    path: "design.csv"
    fields:
      - "distance"
      - "email"
      - "designType"
      - "language"
      - "Token"
  phases:
    - duration: 60
      arrivalRate: 11
      name: send design
  defaults:
    headers:
      Authorization: 'Bearer {{Token}}'
scenarios:
  - flow:
      - post:
          url: "/design"
          json:
            distance: "{{ distance }}"
            email: "{{ email }}"
            designType: "{{ designType }}"
            language: "{{ language }}"
          headers:
            Authorization: 'Bearer {{Token}}'